let countries = ["Австралия", "Австрия", "Азербайджан", "Албания", "Алжир", "Ангола", "Андорра", "Антигуа и Барбуда", "Антильские острова", "Аргентина", "Армения", "Афганистан", "Багамские острова", "Бангладеш", "Барбадос", "Бахрейн", "Белиз", "Белоруссия", "Бельгия", "Бенин", "Болгария", "Боливия", "Босния и Герцеговина", "Ботсвана", "Бразилия", "Буркина-Фасо", "Бурунди", "Бутан", "Вануату", "Ватикан", "Великобритания", "Венгрия", "Венесуэла", "Вьетнам", "Габон", "Гаити", "Гайана", "Гамбия", "Гана", "Гватемала", "Гвинея", "Гвинея-Бисау", "Германия", "Голландия", "Гондурас", "Гонконг", "Гренада", "Гренландия", "Греция", "Грузия", "Гуам", "Дания", "Демократическая Республика Конго", "Джибути", "Доминиканская республика", "Египет", "Замбия", "Западная Сахара", "Зимбабве", "Израиль", "Индия", "Индонезия", "Иордания", "Ирак", "Иран", "Ирландия", "Исландия", "Испания", "Италия", "Йемен", "Кабо-Верде", "Казахстан", "Камбоджа", "Камерун", "Канада", "Катар", "Кения", "Кипр", "Киргизия", "Кирибати", "Китай", "КНДР", "Колумбия", "Коморские острова", "Коста-Рика", "Кот-д'Ивуар", "Куба", "Кувейт", "Лаос", "Латвия", "Лесото", "Либерия", "Ливан", "Ливия", "Литва", "Лихтенштейн", "Люксембург", "Маврикий", "Мавритания", "Мадагаскар", "Македония", "Малави", "Малайзия", "Мали", "Мальдивы", "Мальта", "Марокко", "Мартиника", "Мексика", "Микронезия", "Мозамбик", "Молдавия", "Монако", "Монголия", "Мьянма", "Намибия", "Непал", "Нигер", "Нигерия", "Никарагуа", "Новая Зеландия", "Новая Каледония", "Норвегия", "ОАЭ", "Оман", "Пакистан", "Палестина", "Панама", "Папуа-Новая Гвинея", "Парагвай", "Перу", "Польша", "Португалия", "Пуэрто-Рико", "Республика Конго", "Республика Корея", "Россия", "Руанда", "Румыния", "Сальвадор", "Сан-Марино", "Сан-Томе и Принсипи", "Саудовская Аравия", "Свазиленд", "Сенегал", "Сент-Китс и Невис", "Сент-Люсия", "Сербия", "Сингапур", "Сирия", "Словакия", "Словения", "Соломоновы острова", "Сомали", "Судан", "Суринам", "США", "Сьерра-Леоне", "Таджикистан", "Таиланд", "Тайвань", "Танзания", "Того", "Тонга", "Тринидад и Тобаго", "Тунис", "Туркменистан", "Турция", "Уганда", "Узбекистан", "Украина", "Уругвай", "Фиджи", "Филиппины", "Финляндия", "Франция", "Французская Гвиана", "Хорватия", "Центральноафриканская Республика", "Чад", "Черногория", "Чехия", "Чили", "Швейцария", "Швеция", "Шри-Ланка", "Эквадор", "Экваториальная Гвинея", "Эритрея", "Эстония", "Эфиопия", "ЮАР", "Ямайка", "Япония"];
document.getElementById("list").remove();
function autocomplete(inp, arr) {
  /* Функция автозаполнения принимает два аргумента,
  элемент текстового поля и массив возможных значений автозаполнения: */
  let currentFocus;
  /* выполнить функцию, когда кто-то пишет в текстовое поле: */
  inp.addEventListener("input", function (e) {
    let a, b, i, val = this.value;
    /* закрыть все уже открытые списки автозаполненных значений */
    closeAllLists();
    if (!val) { return false; }
    currentFocus = -1;
    /* создать элемент DIV, который будет содержать элементы (значения): */
    a = document.createElement("DIV");
    a.setAttribute("id", "list");
    a.setAttribute("class", "autocomplete-items");
    /* добавить элемент DIV в качестве дочернего элемента контейнера автозаполнения: */
    this.parentNode.appendChild(a);
    /* для каждого элемента в массиве ... */
    for (i = 0; i < arr.length; i++) {
      /* проверить, начинается ли элемент с тех же букв, что и значение текстового поля: */
      if (arr[i].substr(0, val.length).toUpperCase() == val.toUpperCase()) {
        /* создать элемент DIV для каждого соответствующего элемента: */
        b = document.createElement("DIV");
        /* сделать соответствующие буквы жирным шрифтом: */
        b.innerHTML = "<strong>" + arr[i].substr(0, val.length) + "</strong>";
        b.innerHTML += arr[i].substr(val.length);
        /* вставить поле ввода, в котором будет храниться значение текущего элемента массива: */
        b.innerHTML += "<input type='hidden' value='" + arr[i] + "'>";
        /* выполнить функцию, когда кто-то нажимает на значение элемента (элемент DIV): */
        b.addEventListener("click", function (e) {
          /* вставить значение для текстового поля автозаполнения: */
          inp.value = this.getElementsByTagName("input")[0].value;
          /* закрыть список автозаполненных значений, (или любые другие открытые списки автозаполненных значений: */
          closeAllLists();
        });
        a.appendChild(b);
      }
    }
  });

  function closeAllLists(elmnt) {
    /* закрыть все списки автозаполнения в документе, кроме одного, переданного в качестве аргумента: */
    var x = document.getElementsByClassName("autocomplete-items");
    for (var i = 0; i < x.length; i++) {
      if (elmnt != x[i] && elmnt != inp) {
        x[i].parentNode.removeChild(x[i]);
      }
    }
  }
}
autocomplete(document.getElementById("country"), countries);